Revit 2024 API
View3D.ProjectGridsOnSectionBox Property
 This option projects all grids from the current 3d view on the bottom face of the section box. Only grids that are inside or intersects the section box
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public bool ProjectGridsOnSectionBox { get; set; }
Visual Basic
Public Property ProjectGridsOnSectionBox As Boolean
	Get
	Set
Visual C++
public:
property bool ProjectGridsOnSectionBox {
	bool get ();
	void set (bool value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  Returns true if the view is not a view template.
See Also
View3D Class
Autodesk.Revit.DB Namespace